DexSys/DataProcessors/ОчисткаТаблицы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОчисткаТаблицы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьТест</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DexSys/DataProcessors/ОчисткаТаблицы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УдалитьСтрокиПоУсловию(Команда)
	
	СтрокиНаУдаление = ОтобратьСтроки();
	
	Для Каждого СтрокаОтобранная из СтрокиНаУдаление Цикл
		
		Объект.ТабличнаяЧастьТест.Удалить(СтрокаОтобранная);
		
	КонецЦикла; // СтрокаОтобранная
	
КонецПроцедуры

&НаКлиенте
Функция ОтобратьСтроки()
	
	// сб и вс
	ДниНеделиОтбора = Новый Массив;
	ДниНеделиОтбора.Добавить(6);
	ДниНеделиОтбора.Добавить(7);
	
	ДатаНач = Дата(1,1,1,10,0,0);
	ДатаКон = Дата(1,1,1,19,0,0);
	
	СтрокиНаУдаление = Новый Массив;
	
	Для Каждого СтрокаТЧ из Объект.ТабличнаяЧастьТест Цикл
		
		Добавлено = Ложь;
		НайденоПоДнюНедели = ДниНеделиОтбора.Найти(ДеньНедели(СтрокаТЧ.Дата));
		
		// Если индекс будет 0, то ЗначениеЗаполнено не подойдет
		Если Не НайденоПоДнюНедели = Неопределено Тогда
			СтрокиНаУдаление.Добавить(СтрокаТЧ);
			Продолжить;
		КонецЕсли;
		
		ДатаВремя = ПолучитьДатуИзСтроки(СтрокаТЧ.Время);
		Если ЗначениеЗаполнено(ДатаВремя) Тогда
			
			Если ДатаВремя <= ДатаНач Или ДатаВремя >= ДатаКон Тогда
				СтрокиНаУдаление.Добавить(СтрокаТЧ);
			КонецЕсли; // ДатаВремя < ДатаНач Или ДатаВремя > ДатаКон
			
		КонецЕсли; // ЗначениеЗаполнено
		
	КонецЦикла; // СтрокаТЧ
	
	Возврат СтрокиНаУдаление;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДатуИзСтроки(ВремяСтрокой)
	
	Попытка
		ВремяНов = СтрЗаменить(ВремяСтрокой,":","");
		ВремяНов = "00010101" + ВремяНов;
		Возврат Дата(ВремяНов);
	Исключение
		Возврат Неопределено
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Счет = 15;
	ДатаДляТЧ = ТекущаяДата();
	СуммаДляТЧ = 345;
	ДеньВСекундах = 60*60*24;
	
	Для Индекс = 0 по Счет Цикл
		
		СтрокаТЧ = Объект.ТабличнаяЧастьТест.Добавить();
		СтрокаТЧ.Дата = ДатаДляТЧ;
		СтрокаТЧ.Время = Формат(ДатаДляТЧ,"ДЛФ=T");
		СтрокаТЧ.Сумма = СуммаДляТЧ;
		
		ДатаДляТЧ = ДатаДляТЧ + ДеньВСекундах;
		СуммаДляТЧ = СуммаДляТЧ + 1;
		
	КонецЦикла;
	
КонецПроцедуры
